/*
********************************************************************************
                                UART串口通信

文件名    ：io_output.c
版本      ：
程序员    ：Tank_CG
********************************************************************************
说明：基于Tank交通机器人控制板
********************************************************************************
*/


/*
********************************************************************************
                               头文件        
********************************************************************************
*/
#include "io_output.h"

/*
********************************************************************************
                               函数申明       
********************************************************************************
*/


/*
********************************************************************************
                         void OutPutInit(void)

描述： DO输出初始化
参数：  
返回值：无
********************************************************************************
*/
void OutPutInit(void)
{
  
  GPIO_InitTypeDef  GPIO_InitStructure;
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  

  GPIO_ResetBits(GPIOC,GPIO_Pin_0);

 
  
}



